import random
import logging
from .. import loader, utils
from asyncio import sleep
from ..loader import ModuleConfig as mc
logger = logging.getLogger(__name__)

def register(cb):
    cb(ArtsMod())

class ArtsMod(loader.Module):
    """Юникод арты"""
    strings = {'name': 'Arts'}

    def __init__(self):
        self.config = mc("F_LENGTHS", [5, 1, 1, 4, 1, 1, 1])
        
        
    async def vjuhcmd(self, message):
        """Используй .vjuh <текст> c:"""
        text = utils.get_args_raw(message)
        if not text:
            await message.edit("<b>Нету текста после команды :c</b>")
            return
        else:
            vjuh = ("<code>.∧＿∧\n"
                    "( ･ω･｡)つ━☆・*。\n"
                    "⊂  ノ    ・゜ .\n"
                    "しーＪ   °。  *´¨)\n"
                    "             .· ´¸.·*´¨) ¸.·*¨)\n"
                    "                     (¸.·´ (¸.·'* ☆\n\n"
                    "Вжух и ты </code>" + """<code>{}</code>""").format(text)
            await message.edit(vjuh)

        if text == "podpiska":
            await message.edit("<code>.∧＿∧\n"
                               "( ･ω･｡)つ━☆・*。\n"
                               "⊂  ノ    ・゜ .\n"
                               "しーＪ   °。  *´¨)\n"
                               "             .· ´¸.·*´¨) ¸.·*¨)\n"
                               "                     (¸.·´ (¸.·'* ☆\n\n"
                               "Вжух и ты подпишешься -></code> @ftgmodulesbyfl1yd <code>и</code> @cheats_and_modulesFTG")


    async def cowsaycmd(self, message):
        """Используй .cowsay <текст> c:"""
        text = utils.get_args_raw(message)
        if not text:
            await message.edit("<b>Нету текста после команды :c</b>")
            return
        else:
            cowsay = ("<code> "
                      "< {} >\n"
                      "\n"
                      "     \   ^__^\n"
                      "	     \  (oo)\_______\n"
                      "         (__)\       )\/\n"
                      "             ||----w||\n"
                      "	            ||     ||</code>").format(text)
            await message.edit(cowsay)


    async def padayucmd(self, message):
        """Используй .padayu <текст>; ничего c:"""
        text = utils.get_args_raw(message)
        if not text:
            text = ("ПАДАЮ")
            padayu = ("┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃ <b>{}</b>!\n"
                      "┓┏┓┏┓┃ ＼○／\n"
                      "┛┗┛┗┛┃ /\n"
                      "┓┏┓┏┓┃ノ)\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n").format(text)
            await message.edit(padayu)
        else:
            padayu = ("┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃ <b>{}</b>!\n"
                      "┓┏┓┏┓┃ ＼○／\n"
                      "┛┗┛┗┛┃ /\n"
                      "┓┏┓┏┓┃ノ)\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n"
                      "┓┏┓┏┓┃\n"
                      "┛┗┛┗┛┃\n").format(text)
            await message.edit(padayu)


    async def priletelcmd(self, message):
        """Используй .prilitel <текст>; ничего c:"""
        text = utils.get_args_raw(message)
        if not text:
            text = ("Я ЛЮБЛЮ СОСАТЬ ХУИ, А ТЫ?!")
            prilitel = ("▬▬▬.◙.▬▬▬\n"
                        "  ═▂▄▄▓▄▄▂\n"
                        "◢◤ █▀▀████▄▄▄▄◢◤\n"
                        "█▄ █ █▄ ███▀▀▀▀▀▀▀╬\n"
                        "◥█████◤ прилетел сказать что-то важное...\n"
                        "══╩══╩═\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬☻/ - <b>{}</b>\n"
                        "╬═╬/▌\n"
                        "╬═╬/ \ ").format(text)
            await message.edit(prilitel)
        else:
            prilitel = ("▬▬▬.◙.▬▬▬\n"
                        "  ═▂▄▄▓▄▄▂\n"
                        "◢◤ █▀▀████▄▄▄▄◢◤\n"
                        "█▄ █ █▄ ███▀▀▀▀▀▀▀╬\n"
                        "◥█████◤ прилетел сказать что-то важное...\n"
                        "══╩══╩═\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬\n"
                        "╬═╬☻/ - <b>{}</b>\n"
                        "╬═╬/▌\n"
                        "╬═╬/ \ ").format(text)
            await message.edit(prilitel)


    async def huytebecmd(self, message):
        """Используй .huytebe <текст>; ничего c:"""
        text = utils.get_args_raw(message)
        if not text:
            text = ("ХУЙ ТЕБЕ!")
            huytebe = ("...............▄▄▄▄▄\n"
                       "..............▄▌░░░░▐▄\n"
                       "............▐░░░░░░░▌\n"
                       "....... ▄█▓░░░░░░▓█▄\n"
                       "....▄▀░░▐░░░░░░▌░▒▌\n"
                       ".▐░░░░▐░░░░░░▌░░░▌\n"
                       "▐ ░░░░▐░░░░░░▌░░░▐\n"
                       "▐ ▒░░░ ▐░░░░░░▌░▒▒▐ \n"
                       "▐ ▒░░░░▐░░░░░░▌░▒▐\n"
                       "..▀▄▒▒▒▒▐░░░░░░▌▄▀\n"
                       "........ ▀▀▀ ▐░░░░░░▌\n"
                       ".................▐░░░░░░▌\n"
                       ".................▐░░░░░░▌\n"
                       ".................▐░░░░░░▌\n"
                       ".................▐░░░░░░▌\n"
                       "................▐▄▀▀▀▀▀▄▌\n"
                       "...............▐▒▒▒▒▒▒▒▒▌\n"
                       "...............▐▒▒▒▒▒▒▒▒▌\n"
                       "................▐▒▒▒▒▒▒▒▌\n"
                       "..................▀▌▒▀▒▐▀\n"
                       "\n"
                       "<b>{}</b>").format(text)
            await message.edit(huytebe)
        else:
            huytebe = ("...............▄▄▄▄▄\n"
                       "..............▄▌░░░░▐▄\n"
                       "............▐░░░░░░░▌\n"
                       "....... ▄█▓░░░░░░▓█▄\n"
                       "....▄▀░░▐░░░░░░▌░▒▌\n"
                       ".▐░░░░▐░░░░░░▌░░░▌\n"
                       "▐ ░░░░▐░░░░░░▌░░░▐\n"
                       "▐ ▒░░░ ▐░░░░░░▌░▒▒▐ \n"
                       "▐ ▒░░░░▐░░░░░░▌░▒▐\n"
                       "..▀▄▒▒▒▒▐░░░░░░▌▄▀\n"
                       "........ ▀▀▀ ▐░░░░░░▌\n"
                       ".................▐░░░░░░▌\n"
                       ".................▐░░░░░░▌\n"
                       ".................▐░░░░░░▌\n"
                       ".................▐░░░░░░▌\n"
                       "................▐▄▀▀▀▀▀▄▌\n"
                       "...............▐▒▒▒▒▒▒▒▒▌\n"
                       "...............▐▒▒▒▒▒▒▒▒▌\n"
                       "................▐▒▒▒▒▒▒▒▌\n"
                       "..................▀▌▒▀▒▐▀\n"
                       "\n"
                       "<b>{}</b>").format(text)
            await message.edit(huytebe)


    async def coffeecmd(self, message):
        """Используй .coffee <текст>; ничего с:"""
        text = utils.get_args_raw(message)
        if not text:
            text = ("Это тебе :з")
            coffee = ("─▄▀─▄▀\n"
                      "──▀──▀\n"
                      "█▀▀▀▀▀█▄\n"
                      "█░░░░░█─█\n"
                      "▀▄▄▄▄▄▀▀\n\n"
                      "<b>{}</b>").format(text)
            await message.edit(coffee)
        else:
            coffee = ("─▄▀─▄▀\n"
                      "──▀──▀\n"
                      "█▀▀▀▀▀█▄\n"
                      "█░░░░░█─█\n"
                      "▀▄▄▄▄▄▀▀\n\n"
                      "<b>{}</b>").format(text)
            await message.edit(coffee)


    async def tvcmd(self, message):
        """Используй .TV <текст>; ничего с:"""
        text = utils.get_args_raw(message)
        if not text:
            text = ("ТЕЛЕВИЗОР ГОВОРИТ ЧТО ТЫ ДОЛБОЁБ!")
            tv = ("░▀▄░░▄▀\n"
                  "▄▄▄██▄▄▄▄▄░▀█▀▐░▌\n"
                  "█▒░▒░▒░█▀█░░█░▐░▌\n"
                  "█░▒░▒░▒█▀█░░█░░█\n"
                  "█▄▄▄▄▄▄███══════\n\n"
                  "<b>{}</b>").format(text)
            await message.edit(tv)
        else:
            tv = ("░▀▄░░▄▀\n"
                  "▄▄▄██▄▄▄▄▄░▀█▀▐░▌\n"
                  "█▒░▒░▒░█▀█░░█░▐░▌\n"
                  "█░▒░▒░▒█▀█░░█░░█\n"
                  "█▄▄▄▄▄▄███══════\n\n"
                  "<b>{}</b>").format(text)
            await message.edit(tv)


    async def grencmd(self, message):
        """Используй .gren <текст>; ничего с:"""
        text = utils.get_args_raw(message)
        if not text:
            text = ("ВЗРЫВАЮ ТЕБЯ НАХУЙ!")
            gren = ("─▄▀▀███═◯\n"
                    "▐▌▄▀▀█▀▀▄\n"
                    "█▐▌─────▐▌\n"
                    "█▐█▄───▄█▌\n"
                    "▀─▀██▄██▀\n\n"
                    "<b>{}</b>").format(text)
            await message.edit(gren)
        else:
            gren = ("─▄▀▀███═◯\n"
                    "▐▌▄▀▀█▀▀▄\n"
                    "█▐▌─────▐▌\n"
                    "█▐█▄───▄█▌\n"
                    "▀─▀██▄██▀\n\n"
                    "<b>{}</b>").format(text)
            await message.edit(gren)


    async def huycmd(self, message):
        """Используй .huy <emoji>; ничего"""
        emoji = utils.get_args_raw(message)
        huy = ("🍆🍆\n"
               "🍆🍆🍆\n"
               "  🍆🍆🍆\n"
               "    🍆🍆🍆\n"
               "     🍆🍆🍆\n"
               "       🍆🍆🍆\n"
               "        🍆🍆🍆\n"
               "         🍆🍆🍆\n"
               "          🍆🍆🍆\n"
               "          🍆🍆🍆\n"
               "      🍆🍆🍆🍆\n"
               " 🍆🍆🍆🍆🍆🍆\n"
               " 🍆🍆🍆  🍆🍆🍆\n"
               "    🍆🍆        🍆🍆")
        if emoji:
            huy = huy.replace("🍆", emoji)
        await message.edit(huy)


    async def fcmd(self, message):
        """Используй .f с:"""
        args = utils.get_args_raw(message)
        if not args:
            r = random.randint(0, 5)
            logger.debug(r)
            if r == 0:
                await utils.answer(message, "┏━━━┓\n┃┏━━┛\n┃┗━━┓\n┃┏━━┛\n┃┃\n┗┛")
            elif r == 1:
                await utils.answer(message, "╭━━━╮\n┃╭━━╯\n┃╰━━╮\n┃╭━━╯\n┃┃\n╰╯")
            elif r == 2:
                await utils.answer(message, "̫͍F̥̼F͈̫F͔̱F͓̤F̭̺F̙F͍͕F͚̩F̣̱F͖ͅF̣͙F̗͕F̦͚F̯͍ ̘͇F̰̹F̦̩F͙ͅF̙̹F̝͚ ̻F̥̙F ͙̹ ̩͔ ̘͈ ͍̭\n"
                                            "̹̖F̲͔F̜ ̗͎F̭̰F̰̭F̼͍F̹̞F̱͉F͓͓F̬ ̼ͅF̤͔F̦͉Fм̟̙F̦̹F͚̠FF̪̝ ̩̗F͇͓F̟̙F͎͎F͉͚ ̥̟ ̙͚\n"
                                            "̯̻F͓͈F̮͔F͉̫F͕̥ ͔̙ ̣ ͙г\n"
                                            "̞̖F̝̗F͙͓F̟͓F̖̝ ̤͙\n"
                                            "͔͓F̠F̖ͅF̰̹F ̠̟\n"
                                            "͓͕F̹͙ ̲̩F̙̠F͇̯F̖̗ ̺ ̱͔ \n"
                                            "̜͚F ̱̥F̥̝F̖̦F͇͔ ̜͓ ̪̹\n"
                                            "̩̗F̬̟F̰F̙͇F F͉̖F̼ͅF̬͔F͇͖F̞̥F̙̺F̖̮ ̥̙F̜͔F̩̜F͎̣F̲̤F̪̙FF̰̫F̝̘ ̣̻F͙͎ ̜̱ ̠͈F̬̫ ̦̩ \n"
                                            "͎͙F̘F͍̲ ̲ͅF͇͇F̜̥F͖͖F̪̟ ̤̩F̠̩F̬͕F̪ ̰̪F̫͍ ̺͓F͕̤F̰ͅ ̬̼F̮̼F ͎̯F͓̟F̻͔F̪F͈̭ ̠͓F̣̺ ̭F̮̩ ͖̣\n"
                                            "̙F͎̞F̻ F͖͔F͕̮F̯͖FF̪͕F̫͚F̣̣ ̗̣F̩ ̫͍F̥F̗̮F̻̫F͍̺F̞͉F͚̩F͕̤ ͉̤FF̼͙ ͔͕ ͉ ͙\n"
                                            "͍͙ F̯̬F̲̻F̥̟F̝̙ ̘\n"
                                            "̦̝ ͔ ̝̬F̝͍F̖͚ F̥͚F̖͉ ̩͔ \n"
                                            "͓̪F̝͉F̜ͅF̦ͅF͓͕ ̜̭\n"
                                            "͖F ͎̩F̩͕F̻͖F̯̼ ̼̼ ̹͔\n"
                                            "͍̱FF̹̥F̭͓F̦̺ ̖͎\n"
                                            "̥̜F̞͎F̖̲F̦̹F̬̘ \n"
                                            "̦̬F̺̭F͖̗F͕͍F̟͙ ͓͍")
            elif r == 3:
                await utils.answer(message, "🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕\n"
                                            "🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕\n"
                                            "🌕🌕🌗🌑🌑🌑🌑🌑🌓🌕🌕\n"
                                            "🌕🌕🌗🌑🌑🌑🌑🌑🌕🌕🌕\n"
                                            "🌕🌕🌗🌑🌓🌕🌕🌕🌕🌕🌕\n"
                                            "🌕🌕🌗🌑🌓🌕🌕🌕🌕🌕🌕\n"
                                            "🌕🌕🌗🌑🌑🌑🌑🌓🌕🌕🌕\n"
                                            "🌕🌕🌗🌑🌑🌑🌑🌕🌕🌕🌕\n"
                                            "🌕🌕🌗🌑🌓🌕🌕🌕🌕🌕🌕\n"
                                            "🌕🌕🌗🌑🌓🌕🌕🌕🌕🌕🌕\n"
                                            "🌕🌕🌗🌑🌓🌕🌕🌕🌕🌕🌕\n"
                                            "🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕\n"
                                            "🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕")
            elif r == 4:
                await utils.answer(message, "┏━━━┓╋╋╋╋╋╋╋╋╋╋╋┏━━━┓\n"
                                            "┃┏━┓┃╋╋╋╋╋╋╋╋╋╋╋┃┏━━┛\n"
                                            "┃┗━┛┣━┳━━┳━━┳━━┓┃┗━━┓\n"
                                            "┃┏━━┫┏┫┃━┫━━┫━━┫┃┏━━┛\n"
                                            "┃┃╋╋┃┃┃┃━╋━━┣━━┃┃┃\n"
                                            "┗┛╋╋┗┛┗━━┻━━┻━━┛┗┛")
            else:
                await utils.answer(message, "██████╗\n"
                                            "██╔═══╝\n"
                                            "████╗░░\n"
                                            "██╔═╝░░\n"
                                            "██║░░░░\n"
                                            "╚═╝░░░░")
        if args:
            out = ""
            for line in self.config["F_LENGTHS"]:
                c = max(round(line / len(args)), 1)
                out += (args * c) + "\n"
            await utils.answer(message, "<code>" + utils.escape_html(out) + "</code>")